tap "homebrew/cask"
tap "homebrew/core"

# Terminal setup
brew "git"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

brew "openssl@3"
brew "gmp"
brew "rust"
brew "gh"
brew "postgresql"
brew "libpq"
brew "libyaml"
brew "mise"
brew "neovim"
brew "sqlite"

# Applications
cask "1password"
cask "1password-cli"
cask "chatgpt"
cask "docker"
cask "slack"
cask "spotify"
cask "claude-code"
cask "cursor"
cask "obsidian"
cask "google-chrome"

# Fonts
cask "font-jetbrains-mono"      # JetBrains' monospaced font for developers
