brew "openssl@3"
brew "gmp"
brew "rust"
brew "gh"
brew "postgresql"
brew "libpq"        # PostgreSQL C API library
brew "libyaml"
brew "mise"         # Polyglot runtime manager (successor to asdf)
brew "neovim"       # Modern vim-based text editor
brew "sqlite"       # Lightweight SQL database engine

# Applications
cask "1password"         # Password manager
cask "1password-cli"     # 1Password CLI for secrets management
cask "chatgpt"           # OpenAI ChatGPT desktop app
cask "docker"
cask "slack"
cask "spotify"
cask "claude-code"
cask "cursor"
cask "obsidian"
cask "google-chrome"

# Fonts
cask "font-jetbrains-mono"      # JetBrains' monospaced font for developers
